app/views/todolists/index.html.erb

SELECT  1 AS one FROM "todoitems"  WHERE "todoitems"."todolist_id" = ? LIMIT 1  [["todolist_id", 63]]
---
    <% @todolists.each do |todolist| %>
	<%if todolist.todoitems.empty? %>