app/views/todolists/show.html.erb

SELECT  1 AS one FROM "todoitems"  WHERE "todoitems"."todolist_id" = ? LIMIT 1  [["todolist_id", 63]]
---
  <strong>
  <%if @todolist.todoitems.empty? %>