app/controllers/todolists_controller.rb

SELECT COUNT(*) FROM "todolists"  WHERE "todolists"."user_id" = ?  [["user_id", 5]]
---
  def index
    @todolists = current_user.todolists.paginate(page: params[:page], per_page: 5)

SELECT COUNT(*) FROM "todoitems"  WHERE "todoitems"."todolist_id" = ?  [["todolist_id", 63]]
---
  def show
	  @todoitems = @todolist.todoitems.paginate(page: params[:page], per_page: 5)

INSERT INTO "todolists" ("created_at", "list_due_date", "list_name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-08-06 22:24:53.729028"], ["list_due_date", "2014-08-06"], ["list_name", "My new list"], ["updated_at", "2014-08-06 22:24:53.729028"], ["user_id", 5]]
---
  def create
    @todolist = current_user.todolists.new(todolist_params)

    respond_to do |format|
      if @todolist.save

UPDATE "todolists" SET "list_due_date" = ?, "updated_at" = ? WHERE "todolists"."id" = 63  [["list_due_date", "2009-03-02"], ["updated_at", "2014-08-06 22:25:45.019097"]]
---
  def update
    respond_to do |format|
      if @todolist.update(todolist_params)

DELETE FROM "todolists" WHERE "todolists"."id" = ?  [["id", 59]]
---
  def destroy
    @todolist.destroy