app/controllers/todoitems_controller.rb

  def create
    @todoitem = @todolist.todoitems.new(todoitem_params)
    @todoitem.done = false
    if @todoitem.save
---
INSERT INTO "todoitems" ("created_at", "description", "done", "due_date", "task_title", "todolist_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @todoitem = @todolist.todoitems.find(params[:id])
    respond_to do |format|
      if @todoitem.update(todoitem_done_params)
---
UPDATE "todoitems" SET "done" = ?, "updated_at" = ? WHERE "todoitems"."id" = 127  [["done", "t"], ["updated_at", "2014-08-06 21:23:52.756603"]]

  def destroy
    @todoitem = @todolist.todoitems.find(params[:id])
    @todoitem.destroy
---
DELETE FROM "tags_todoitems" WHERE "tags_todoitems"."todoitem_id" = ?  [["todoitem_id", 129]]
DELETE FROM "todoitems" WHERE "todoitems"."id" = ?  [["id", 129]]